/* No comment provided by engineer. */
"401 Unauthorized Request Error whilst trying to upload an asset. Please check you included an Authorization header and that the supplied auth credentials are correct." = "401 Unauthorized Request Error whilst trying to upload an asset. Please check you included an Authorization header and that the supplied auth credentials are correct.";

/* No comment provided by engineer. */
"500 Internal Server Error whilst trying to upload an asset. Please try again." = "500 Εσωτερικό σφάλμα server κατά την αποστολή της εικόνας. Παρακαλώ δοκιμάστε ξανά.";

/* No comment provided by engineer. */
"Add Address from Contacts" = "Προσθήκη Διεύθυνσης από τις Επαφές";

/* No comment provided by engineer. */
"Address Search" = "Αναζήτηση Διεύθυνσης";

/* No comment provided by engineer. */
"Apply" = "Χρήση";

/* No comment provided by engineer. */
"Cancel" = "Άκυρο";

/* No comment provided by engineer. */
"Checkout for Free!" = "Παραγγελία Δωρεάν!";

/* No comment provided by engineer. */
"Choose Country" = "Επιλογή Χώρας";

/* No comment provided by engineer. */
"Choose Delivery Address" = "Επιλογή Διεύθυνσης Παράδοσης";

/* No comment provided by engineer. */
"Clear" = "Καθαρισμός";

/* No comment provided by engineer. */
"Code" = "Κωδικός";

/* No comment provided by engineer. */
"Continue Shopping" = "Συνέχεια Αγορών";

/* No comment provided by engineer. */
"Delivery Details" = "Λεπτομέρειες Παράδοσης";

/* No comment provided by engineer. */
"Enter Address Manually" = "Χειροκίνητη Εισαγωγή Διεύθυνσης";

/* No comment provided by engineer. */
"Failed to store card details with PayPal. Please try again." = "Αποτυχία αποθήκευσης λεπτομερειών κάρτας με το PayPal. Παρακαλώ δοκιμάστε ξανά.";

/* No comment provided by engineer. */
"Failed to synchronize product templates. Please try again." = "Αποτυχία συγχρονισμού προτύπων προϊόντων. Παρακαλώ δοκιμάστε ξανά.";

/* No comment provided by engineer. */
"Failed to validate your promo code. Please try again." = "Αποτυχία επικύρωσης του κωδικού προσφοράς. Παρακαλώ δοκιμάστε ξανά.";

/* Invalid CVV payment failed error dialog title */
"Invalid CVV" = "Άκυρο CVV";

/* No comment provided by engineer. */
"Invalid Email Address" = "Άκυρη Διεύθυνση Email";

/* No comment provided by engineer. */
"Invalid Phone Number" = "Άκυρος Αριθμός Τηλεφώνου";

/* No comment provided by engineer. */
"Missing Delivery Address" = "Λείπει η διεύθυνση παράδοσης";

/* No comment provided by engineer. */
"Next" = "Επόμενο";

/* No comment provided by engineer. */
"OK" = "Εντάξει";

/* No comment provided by engineer. */
"Only registered %d/%d image URLs with the asset endpoint" = "Only registered %1$d/%2$d image URLs with the asset endpoint";

/* No comment provided by engineer. */
"Oops" = "Ωχ";

/* No comment provided by engineer. */
"Oops!" = "Ωχ!";

/* No comment provided by engineer. */
"Order Id" = "Αναγνωριστικό Παραγγελίας";

/* No comment provided by engineer. */
"Order Summary" = "Σύνοψη Παραγγελίας";

/* No comment provided by engineer. */
"Pay with Card" = "Πληρωμή με Κάρτα";

/* No comment provided by engineer. */
"Pay with Credit Card" = "Πληρωμή με Πιστωτική Κάρτα";

/* No comment provided by engineer. */
"Pay with PayPal" = "Πληρωμή με PayPal";

/* No comment provided by engineer. */
"Payment" = "Πληρωμή";

/* No comment provided by engineer. */
"Payment (Sandbox)" = "Πληρωμή (Sandbox)";

/* Payment declined error dialog title */
"Payment Declined" = "Η Πληρωμή Απορρίφθηκε";

/* Generic payment failed error dialog title */
"Payment Failed" = "Η Πληρωμή Απέτυχε";

/* No comment provided by engineer. */
"Please choose an address to have your order shipped to" = "Παρακαλώ επιλέξτε μια διεύθυνση για την αποστολή της παραγγελίας σας";

/* No comment provided by engineer. */
"Please enter a valid email address" = "Παρακαλώ εισάγετε μια έγκυρη διεύθυνση email";

/* No comment provided by engineer. */
"Please enter a valid phone number" = "Παρακαλώ εισάγετε έναν έγκυρο αριθμό τηλεφώνου";

/* No comment provided by engineer. */
"Processing" = "Επεξεργασία";

/* No comment provided by engineer. */
"Promotional Codes" = "Κωδικοί Προσφοράς";

/* No comment provided by engineer. */
"Required by Royal Mail in case there are any issues during delivery" = "Απαιτείται από το ταχυδρομείο σε περίπτωση προβλημάτων κατά την παράδοση";

/* No comment provided by engineer. */
"Retry" = "Επανάληψη";

/* No comment provided by engineer. */
"Search for Address" = "Αναζήτηση Διεύθυνσης";

/* No comment provided by engineer. */
"Shipping" = "Αποστολή";

/* No comment provided by engineer. */
"Sorry we couldn't recognize your card. Please try again manually entering your card details if necessary." = "Συγγώμη δεν αναγνωρίζουμε την κάρτα. Παρακαλώ δοκιμάστε ξανά είσαγοντας χειροκίνητα τα στοιχεία αν χρειαστεί.";

/* No comment provided by engineer. */
"Total" = "Σύνολο";

/* Generic payment failed error dialog message */
"Unfortunately we failed to take a payment from your card. Please try again." = "Δυστυχώς αποτύχαμε να δεχτούμε την πληρωμή απο την κάρτα σας. Παρακαλώ δοκιμάστε ξανά.";

/* No comment provided by engineer. */
"We'll send you a confirmation and order updates" = "Θα σας στείλουμε επιβεβαίωση και ενημερώσεις για την παραγγελία";

/* Invalid CVV payment failed error dialog message */
"You have entered an invalid CVV number. Please check it and try again." = "Εισάγατε λάθος αριθμό CVV. Παρακαλώ ελέγξτε τον και δοκιμάστε ξανά.";

/* Payment declined error dialog message */
"Your payment has been declined. Please check your card details and try again." = "Η πληρωμή σας απορρίφθηκε. Παρακαλώ ελέγξτε τα στοιχεία της κάρτας σας και δοκιμάστε ξανά.";

/* No comment provided by engineer. */
"Your payment was not approved (transaction state: %@). Please try again." = "Η πληρωμή σας δεν εγκρίθηκε (κατάσταση συναλλαγής: %@). Παρακαλώ δοκιμάστε ξανά.";

